-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: salon_db
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `product_usage`
--

DROP TABLE IF EXISTS `product_usage`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product_usage` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `created_at` datetime(6) NOT NULL,
  `price` decimal(12,2) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `quantity_used` int NOT NULL,
  `service_code` varchar(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product_usage`
--

LOCK TABLES `product_usage` WRITE;
/*!40000 ALTER TABLE `product_usage` DISABLE KEYS */;
INSERT INTO `product_usage` (`id`,`created_at`,`price`,`product_name`,`quantity_used`,`service_code`) VALUES
                                                                                                          (1,'2025-09-26 07:00:00',335837.29,'Kem dưỡng da tay',4,'DV008'),
                                                                                                          (2,'2025-10-10 07:00:00',464944.99,'Gel tạo kiểu tóc',4,'DV084'),
                                                                                                          (3,'2025-10-03 04:00:00',269037.69,'Thuốc nhuộm đỏ',5,'DV066'),
                                                                                                          (4,'2025-09-25 09:00:00',414790.06,'Tinh dầu thư giãn',3,'DV078'),
                                                                                                          (5,'2025-09-22 12:00:00',284135.97,'Serum dưỡng tóc',2,'DV054'),
                                                                                                          (6,'2025-09-29 02:00:00',402477.07,'Dầu gội thảo dược',3,'DV089'),
                                                                                                          (7,'2025-08-29 06:00:00',340179.48,'Gel tạo kiểu tóc',1,'DV023'),
                                                                                                          (8,'2025-09-02 04:00:00',185175.13,'Sáp vuốt tóc',2,'DV001'),
                                                                                                          (9,'2025-09-13 04:00:00',399481.15,'Dầu gội thảo dược',4,'DV055'),
                                                                                                          (10,'2025-08-31 07:00:00',369723.53,'Gel tạo kiểu tóc',5,'DV012'),
                                                                                                          (11,'2025-10-28 11:00:00',146354.58,'Dầu dưỡng da',4,'DV083'),
                                                                                                          (12,'2025-10-08 09:00:00',53409.16,'Sáp vuốt tóc',3,'DV090'),
                                                                                                          (13,'2025-09-08 01:00:00',190705.56,'Dầu gội cao cấp',1,'DV043'),
                                                                                                          (14,'2025-10-20 06:00:00',359814.02,'Thuốc nhuộm đỏ',3,'DV093'),
                                                                                                          (15,'2025-10-17 04:00:00',99965.51,'Dầu dưỡng da',4,'DV063'),
                                                                                                          (16,'2025-10-24 10:00:00',210862.56,'Kem dưỡng da tay',4,'DV008'),
                                                                                                          (17,'2025-09-10 10:00:00',112957.24,'Kem dưỡng da tay',1,'DV025'),
                                                                                                          (18,'2025-09-26 11:00:00',450571.4,'Tẩy tế bào chết',2,'DV058'),
                                                                                                          (19,'2025-10-16 05:00:00',419591.93,'Mặt nạ spa',4,'DV046'),
                                                                                                          (20,'2025-10-06 06:00:00',85483.56,'Thuốc nhuộm đỏ',1,'DV066'),
                                                                                                          (21,'2025-10-03 06:00:00',414970.04,'Serum dưỡng tóc',2,'DV022'),
                                                                                                          (22,'2025-10-04 09:00:00',93113.46,'Tẩy tế bào chết',4,'DV065'),
                                                                                                          (23,'2025-09-26 12:00:00',386019.1,'Kem ủ tóc',2,'DV064'),
                                                                                                          (24,'2025-10-05 04:00:00',286301.16,'Kem dưỡng ẩm',2,'DV066'),
                                                                                                          (25,'2025-10-22 05:00:00',409336.41,'Sữa rửa mặt',1,'DV001'),
                                                                                                          (26,'2025-09-02 05:00:00',332073.35,'Mặt nạ spa',5,'DV011'),
                                                                                                          (27,'2025-10-01 06:00:00',210772.17,'Sáp vuốt tóc',4,'DV096'),
                                                                                                          (28,'2025-09-04 03:00:00',219522.61,'Dầu gội thảo dược',3,'DV012'),
                                                                                                          (29,'2025-09-08 09:00:00',477612.14,'Sáp vuốt tóc',4,'DV059'),
                                                                                                          (30,'2025-10-06 01:00:00',183875.02,'Kem ủ tóc',3,'DV028'),
                                                                                                          (31,'2025-09-12 01:00:00',233920.69,'Tinh dầu thư giãn',1,'DV033'),
                                                                                                          (32,'2025-09-05 06:00:00',139935.48,'Sữa rửa mặt',3,'DV068'),
                                                                                                          (33,'2025-10-09 02:00:00',386697.08,'Kem ủ tóc',1,'DV080'),
                                                                                                          (34,'2025-10-04 11:00:00',180397.65,'Dầu gội thảo dược',5,'DV034'),
                                                                                                          (35,'2025-09-17 02:00:00',53150.34,'Dầu dưỡng da',5,'DV047'),
                                                                                                          (36,'2025-09-30 05:00:00',403424.97,'Dầu dưỡng da',1,'DV017'),
                                                                                                          (37,'2025-09-15 10:00:00',284479.63,'Dầu dưỡng da',5,'DV044'),
                                                                                                          (38,'2025-09-08 00:00:00',280355.56,'Sữa rửa mặt',2,'DV098'),
                                                                                                          (39,'2025-09-20 09:00:00',405472.31,'Serum dưỡng tóc',1,'DV083'),
                                                                                                          (40,'2025-09-07 04:00:00',123575.66,'Tẩy tế bào chết',2,'DV039'),
                                                                                                          (41,'2025-09-25 07:00:00',439365.25,'Kem dưỡng da tay',1,'DV077'),
                                                                                                          (42,'2025-09-27 01:00:00',418871.76,'Dầu gội thảo dược',4,'DV058'),
                                                                                                          (43,'2025-10-15 03:00:00',223644.12,'Tẩy tế bào chết',2,'DV022'),
                                                                                                          (44,'2025-09-18 08:00:00',373119.64,'Dầu dưỡng da',4,'DV086'),
                                                                                                          (45,'2025-10-03 02:00:00',308614.18,'Tinh dầu thư giãn',5,'DV039'),
                                                                                                          (46,'2025-10-16 06:00:00',479960.82,'Tinh dầu thư giãn',3,'DV016'),
                                                                                                          (47,'2025-09-08 01:00:00',424383.7,'Dầu dưỡng da',4,'DV067'),
                                                                                                          (48,'2025-10-21 11:00:00',93230.31,'Dầu gội thảo dược',5,'DV026'),
                                                                                                          (49,'2025-10-17 10:00:00',170319.09,'Sáp vuốt tóc',1,'DV085'),
                                                                                                          (50,'2025-09-10 01:00:00',142603.32,'Dầu dưỡng da',1,'DV029'),
                                                                                                          (51,'2025-10-06 06:00:00',379182.75,'Tinh dầu thư giãn',5,'DV033'),
                                                                                                          (52,'2025-10-02 07:00:00',173818.48,'Dầu gội thảo dược',1,'DV007'),
                                                                                                          (53,'2025-09-29 01:00:00',358349.34,'Tẩy tế bào chết',3,'DV076'),
                                                                                                          (54,'2025-10-26 11:00:00',180238.5,'Serum dưỡng tóc',5,'DV062'),
                                                                                                          (55,'2025-09-26 08:00:00',284399.25,'Thuốc nhuộm đỏ',3,'DV052'),
                                                                                                          (56,'2025-09-01 12:00:00',136088.58,'Serum dưỡng tóc',5,'DV087'),
                                                                                                          (57,'2025-09-13 04:00:00',89393.86,'Tẩy tế bào chết',5,'DV081'),
                                                                                                          (58,'2025-09-12 01:00:00',286701.76,'Dầu dưỡng da',1,'DV081'),
                                                                                                          (59,'2025-10-12 02:00:00',271009.29,'Kem dưỡng da tay',1,'DV010'),
                                                                                                          (60,'2025-09-09 11:00:00',408110.4,'Kem dưỡng ẩm',1,'DV098'),
                                                                                                          (61,'2025-09-11 05:00:00',219118.22,'Kem dưỡng ẩm',4,'DV040'),
                                                                                                          (62,'2025-10-03 06:00:00',51650.41,'Kem ủ tóc',2,'DV075'),
                                                                                                          (63,'2025-09-23 05:00:00',78285.03,'Dầu gội thảo dược',2,'DV021'),
                                                                                                          (64,'2025-10-19 02:00:00',130431.24,'Kem dưỡng ẩm',2,'DV082'),
                                                                                                          (65,'2025-10-27 10:00:00',397561.86,'Dầu gội cao cấp',1,'DV038'),
                                                                                                          (66,'2025-09-29 05:00:00',278162.95,'Xịt khoáng',4,'DV019'),
                                                                                                          (67,'2025-09-27 04:00:00',230329.97,'Tinh dầu thư giãn',2,'DV007'),
                                                                                                          (68,'2025-10-06 04:00:00',152315.02,'Thuốc nhuộm đỏ',5,'DV059'),
                                                                                                          (69,'2025-09-19 02:00:00',225300.11,'Dầu dưỡng da',5,'DV099'),
                                                                                                          (70,'2025-09-16 03:00:00',226716.9,'Dầu gội thảo dược',5,'DV057'),
                                                                                                          (71,'2025-09-24 07:00:00',479684.24,'Xịt khoáng',5,'DV038'),
                                                                                                          (72,'2025-09-22 01:00:00',432365.38,'Sáp vuốt tóc',5,'DV013'),
                                                                                                          (73,'2025-10-27 05:00:00',462694.01,'Kem dưỡng da tay',3,'DV049'),
                                                                                                          (74,'2025-10-07 00:00:00',305113.18,'Xịt khoáng',2,'DV069'),
                                                                                                          (75,'2025-10-11 06:00:00',487984.14,'Gel tạo kiểu tóc',4,'DV023'),
                                                                                                          (76,'2025-10-27 11:00:00',137785.13,'Kem ủ tóc',2,'DV020'),
                                                                                                          (77,'2025-09-30 03:00:00',342480.62,'Kem dưỡng ẩm',2,'DV073'),
                                                                                                          (78,'2025-10-27 11:00:00',113255.32,'Dầu gội thảo dược',2,'DV034'),
                                                                                                          (79,'2025-09-03 11:00:00',355820.29,'Tinh dầu thư giãn',2,'DV004'),
                                                                                                          (80,'2025-09-08 01:00:00',359966.11,'Gel tạo kiểu tóc',4,'DV008'),
                                                                                                          (81,'2025-10-12 03:00:00',481835.4,'Kem dưỡng ẩm',1,'DV027'),
                                                                                                          (82,'2025-09-20 11:00:00',182664.72,'Tẩy tế bào chết',4,'DV012'),
                                                                                                          (83,'2025-10-03 01:00:00',89095.91,'Sữa rửa mặt',1,'DV023'),
                                                                                                          (84,'2025-10-21 05:00:00',147247.13,'Dầu gội cao cấp',4,'DV048'),
                                                                                                          (85,'2025-10-24 04:00:00',119871.53,'Dầu gội cao cấp',5,'DV007'),
                                                                                                          (86,'2025-09-29 04:00:00',309943.33,'Mặt nạ spa',1,'DV030'),
                                                                                                          (87,'2025-10-26 02:00:00',237493.5,'Sữa rửa mặt',4,'DV096'),
                                                                                                          (88,'2025-09-09 04:00:00',235302.38,'Kem dưỡng ẩm',5,'DV091'),
                                                                                                          (89,'2025-09-15 06:00:00',284215.12,'Sáp vuốt tóc',3,'DV002'),
                                                                                                          (90,'2025-10-25 03:00:00',149051.98,'Kem ủ tóc',2,'DV082'),
                                                                                                          (91,'2025-10-10 09:00:00',232970.92,'Dầu dưỡng da',2,'DV077'),
                                                                                                          (92,'2025-09-12 06:00:00',249385.67,'Tinh dầu thư giãn',2,'DV025'),
                                                                                                          (93,'2025-10-10 04:00:00',395083.3,'Tẩy tế bào chết',4,'DV024'),
                                                                                                          (94,'2025-10-07 01:00:00',400629.56,'Serum dưỡng tóc',3,'DV009'),
                                                                                                          (95,'2025-10-28 05:00:00',152246.6,'Mặt nạ spa',3,'DV052'),
                                                                                                          (96,'2025-10-09 12:00:00',194015.59,'Xịt khoáng',1,'DV005'),
                                                                                                          (97,'2025-10-12 06:00:00',61490.56,'Dầu gội thảo dược',4,'DV069'),
                                                                                                          (98,'2025-08-30 09:00:00',152713.15,'Xịt khoáng',4,'DV020'),
                                                                                                          (99,'2025-09-19 07:00:00',116123.83,'Kem dưỡng ẩm',1,'DV040'),
                                                                                                          (100,'2025-09-19 03:00:00',170137.45,'Dầu gội cao cấp',3,'DV066');
/*!40000 ALTER TABLE `product_usage` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-10-28 10:21:37
